let label = '$'
while (true) {
    switch (label) {
        case '$':
            $执行.设置背景({ 资源路径: '/ImageAsset/bg_black.webp', X坐标: 0, Y坐标: 0 })
        case '*01':
            诺瓦: '……我将踏上一段愉快的旅程。' + '/AudioClip/noi0001.flac'
            $执行.清空立绘()
            $执行.设置背景({ 资源路径: '/ImageAsset/bg_white.webp', 缩放: 2, 持续时间: 1000 })
            '……与你一同的旅程。' + '/AudioClip/noi0002.flac'
            '无论何时……都与你一起……' + '/AudioClip/noi0003.flac'
            $执行.设置背景({ 资源路径: '/ImageAsset/bg000d.webp', 缩放: 1.021, 持续时间: 1000 })
            $: ' ——哐当哐当。'
            $执行.设置背景({ 资源路径: '/ImageAsset/bg040c.webp', 缩放: 1.021, 持续时间: 1000 })
            $执行.设置音效({ 资源路径: '/AudioClip/se004.flac', 循环播放: true })
            晓: '……'
            $执行.设置背景({ 资源路径: '/ImageAsset/evcg01a.webp', 持续时间: 500.0 })
            $: ' 清风吹拂。\n 与其说是风在吹。'
            ' 不如说我正以子弹般的速度在清风里穿梭。'
            $执行.设置背景({ 资源路径: '/ImageAsset/evcg01b.webp', 持续时间: 500.0 })
            $执行.设置配乐({ 资源路径: '/AudioClip/bgm03.flac', 持续时间: 0 })
            ' 深夜火车之旅。'
            ' 旅行着实令人享受。'
            ' 在旅途中总有意想不到的事物在前方等候。'
            $执行.设置背景({ 资源路径: '/ImageAsset/evcg01a.webp', 持续时间: 1000 })
            // ----
            $执行.关闭音频({ 作用目标: 'se', 持续时间: 0 })
            $执行.关闭图像({ 作用目标: 1, 持续时间: 200 })
            $执行.设置背景({ 资源路径: '/ImageAsset/bg040c.webp', 缩放: 1.021, 持续时间: 1000 })
            $执行.显示界面(false)
            $等待.系统计时(500.0)
            $执行.显示界面(true)
            $执行.对话({ 名称: '黑猫', 文本: '喵。', 语音: '/AudioClip/kur0001.flac' })
            $执行.动效动画({ 作用目标: 0, 预设名称: '摇晃', X轴幅度: 15, 持续时间: 1000 })
            晓: '嗯……哎呀。'
            '来这里。'
            $执行.设置背景({ 资源路径: '/ImageAsset/bg_black.webp', 缩放: 2, 持续时间: 500.0 })
            黑猫: '呼哧。' + '/AudioClip/kur0002.flac'
            $执行.设置背景({
                资源路径: '/ImageAsset/large_evcg01c.webp',
                X坐标: -840.0,
                Y坐标: -610.0,
                持续时间: 500.0
            })
            $执行.动效动画({ 作用目标: 0, 预设名称: '摇晃', Y轴幅度: 15, 持续时间: 2000 })
            $: ' 这位旅伴自然而然地跳上了我的大腿。'
            ' 沉甸甸又暖洋洋的。'
            晓: '你总是这么神出鬼没的。'
            黑猫: '咪。' + '/AudioClip/kur0003.flac'
            晓: '……'
            $执行.设置背景({ 资源路径: '/ImageAsset/evcg01c2.webp', 持续时间: 500.0 })
            $: ' 我再次望向窗外。\n 它金色的眼瞳也随我的视线转向外边。'
            // ----
            $执行.关闭图像({ 作用目标: 1, 持续时间: 200 })
            $执行.设置背景({ 资源路径: '/ImageAsset/bg000d.webp', 缩放: 1.021, 持续时间: 3000 })
            $执行.显示界面(false)
            $等待.系统计时(1000)
            $执行.显示界面(true)
            $执行.对话({ 文本: ' 美丽的星空在我眼前展开。' })
            ' 璀璨夺目，犹如熠熠生辉的宝石箱。'
            ' 这就是此行最大的收获了吧。'
            ' 大概，那是我上小学的时候。'
            ' 不知道是校长还是班主任，又或是一个遗忘在脑海的人。\n 总之曾有人对我说过这样一句话。'
            $执行.设置背景({ 资源路径: '/ImageAsset/bg_black.webp', 缩放: 2, 持续时间: 500.0 })
            ' “这个世界就是个巨大的宝石箱。”'
            ' 璀璨夺目，犹如熠熠生辉的宝石箱。'
            $执行.设置背景({ 资源路径: '/ImageAsset/bg000d.webp', 缩放: 1.021, 持续时间: 1000 })
            ' 如今长大成人了的我才意识到。'
            ' 这句话精确地形容了这个世界，\n 等我有了后代，应该也会把这句话教给他吧。\n 我也想如此对他这么说。用来准确形容这个世界。'
            $执行.设置背景({ 资源路径: '/ImageAsset/bg_black.webp', 缩放: 2, 持续时间: 1000 })
            ' 可讽刺的是，这熠熠生辉的宝石箱究竟蕴含着怎样的“意义”。'
            ' 我已然了如指掌。'
            // ----
            $执行.关闭音频({ 作用目标: 'bgm', 持续时间: 2000 })
            $执行.设置背景({ 资源路径: '/ImageAsset/bg000a.webp', 缩放: 1.021, 持续时间: 3000 })
            $执行.显示界面(false)
            $等待.系统计时(500.0)
            $执行.显示界面(true)
            $执行.对话({ 文本: ' 旅行前一天——。' })
            ' ・・・・・'
            $执行.设置音效({ 资源路径: '/AudioClip/se014.flac', 循环播放: true })
            晓: '……好热。'
            $: ' 骄阳似火。'
            ' 与其说耀眼，不如说是刺眼的阳光。\n 毫不留情地照射在我身上。'
            ' 这个成语正适合形容现在的气温。'
            ' 铄石流金。'
            ' 真是恰到好处。'
            ' 在烈日的暴晒下，我甚至感觉脑浆都要沸腾了。'
            ' 我住在岩手县的乡下。\n 这里离东北部的山区很近。'
            $执行.设置配乐({ 资源路径: '/AudioClip/bgm02.flac', 持续时间: 0 })
            $执行.设置背景({ 资源路径: '/ImageAsset/bg020a.webp', 缩放: 1.021, 持续时间: 500.0 })
            ' 冬季里常常白雪皑皑。\n 属于日本少见的寒冷地带。'
            ' 然而现在却热得反常。'
            ' 不禁让人愈发担心起气候变暖的问题。'
            晓: '……'
            $执行.设置背景({ 资源路径: '/ImageAsset/bg_black.webp', 缩放: 2, 持续时间: 500.0 })
            $执行.动效动画({ 作用目标: 0, 预设名称: '摇晃', X轴幅度: 30, 持续时间: 2000 })
            $: ' 啊，不好。'
            ' 突如其来一阵眩晕感。\n 再站着就要贫血了。'
            $执行.设置背景({ 资源路径: '/ImageAsset/bg020a.webp', 缩放: 1.021, 持续时间: 1000 })
            $执行.动效动画({ 作用目标: 0, 预设名称: '摇晃', X轴幅度: 30, 持续时间: 2000 })
            ' 还是赶快回家避暑吧。'
            $执行.设置背景({ 资源路径: '/ImageAsset/bg000a.webp', 缩放: 1.021, 持续时间: 1000 })
            // ----
            $执行.关闭音频({ 作用目标: 'se', 持续时间: 1000 })
            $等待.转场动画('BlindH8')
            $执行.关闭图像({ 作用目标: 1, 持续时间: 0 })
            $执行.设置背景({ 资源路径: '/ImageAsset/bg_black.webp', 缩放: 2, 持续时间: 0 })
            $执行.显示界面(false)
            $等待.系统计时(200.0)
            $执行.显示界面(true)
            $执行.设置背景({ 资源路径: '/ImageAsset/bg010a.webp', 缩放: 1.021, 持续时间: 1000 })
            $执行.显示界面(false)
            $等待.系统计时(500.0)
            $执行.显示界面(true)
            $执行.对话({ 名称: '晓', 文本: '……呼。' })
            $执行.动效动画({ 作用目标: 0, 预设名称: '摇晃', Y轴幅度: 10, 持续时间: 1500.0 })
            $: ' 虽说屋里没有空调，\n 但好歹能遮阳，还能吹吹风扇，也算不错了。'
            ' 我从口袋里掏出了被汗液略微沾湿的手机。'
            晓: '唉呀。'
            $: ' 委托方发来了一大串消息。'
            ' 我瞥了一眼，第一条就写着：\n  "非常抱歉"'
            ' 虽说剩余内容不用看也知道写了什么，但姑且确认一下。'
            女性的声音: '导演吩咐，分镜制作要暂停。' + '/AudioClip/ona0001.flac'
            '制作流程有变，请确认。' + '/AudioClip/ona0002.flac'
            '请暂时等待下一步的指示。' + '/AudioClip/ona0003.flac'
            晓: '我谢谢你。'
            $: ' 我把手机扔到了一边。'
            ' 去冰箱里拿了点喝的东西，便扑倒在了床上。'
            $执行.设置背景({ 资源路径: '/ImageAsset/bg_black.webp', 缩放: 2, 持续时间: 500.0 })
            $执行.关闭音频({ 作用目标: 'bgm', 持续时间: 2000 })
            $执行.设置音效({ 资源路径: '/AudioClip/se015.flac' })
            ' 真是麻烦，又被喊停了。'
            ' 说到底动画师只是导演的奴隶。\n 只要他没那个意思，我就什么也干不了。'
            ' 或许我打一开始就不该选择这个职业。'
            ' 当初选这个职业……还可以说怀揣着梦想的。'
            $执行.设置背景({ 资源路径: '/ImageAsset/bg_white.webp', 缩放: 2, 持续时间: 1000 })
            ' 但这股热情现在已经丝毫不剩了。'
            晓: '……'
            $执行.设置背景({ 资源路径: '/ImageAsset/bg010a.webp', 缩放: 1.021, 持续时间: 1000 })
            '……唉。'
            $执行.动效动画({ 作用目标: 0, 预设名称: '摇晃', Y轴幅度: 10, 持续时间: 1500.0 })
            $: ' 热得连我的精神都垮了。'
            ' 只是身体疲惫就够受的了。\n 想事情最好还是乐观一点。'
            ' 闲下来了。'
            $执行.设置背景({ 资源路径: '/ImageAsset/bg_black.webp', 缩放: 2, 持续时间: 1000 })
            ' 换句话说，假期来了。'
            ' 趁现在，我想干什么都可以。\n 找点事做吧。'
            晓: '……'
            ' 可没有能做的事啊。'
            $执行.设置背景({ 资源路径: '/ImageAsset/bg010a.webp', 缩放: 1.021, 持续时间: 1000 })
            $: ' 我现在可以说什么都不想干。'
            ' 最近的生活就是拖着疲惫的身子，每天完成工作，\n 然后饮酒，睡觉。日复一日。'
            ' 仅仅是把我该干的干完，\n 其他的什么都没想过。'
            ' 用没有任何想要做的事情为由。\n 借以逃避。'
            晓: '……'
            // ----
            $执行.设置背景({ 资源路径: '/ImageAsset/bg_white.webp', 缩放: 2, 持续时间: 500.0 })
            $执行.显示界面(false)
            $等待.系统计时(500.0)
            $执行.显示界面(true)
            $执行.对话({ 名称: '音理', 文本: '去旅行嘛！', 语音: '/AudioClip/ner0001.flac' })
            晓: '……'
            $执行.设置背景({ 资源路径: '/ImageAsset/bg010a.webp', 缩放: 1.021, 持续时间: 1000 })
            $: ' 唉。'
            ' 我抬起沉重的身体，坐在了电脑前。'
            $执行.设置背景({ 资源路径: '/ImageAsset/large_bg010a.webp', X坐标: -940.0, Y坐标: -360.0, 持续时间: 1000 })
            $执行.动效动画({ 作用目标: 0, 预设名称: '摇晃', Y轴幅度: 15, 持续时间: 2000 })
            ' 旅行社……选哪一家比较好呢。\n 从来没有过这种经验，一点都不了解。'
            ' 就选它好了。\n 天河……银河……嗯。'
            ' 必需的身份证明，好像驾照就够了吧……？'
            $执行.设置背景({ 资源路径: '/ImageAsset/bg000a.webp', 缩放: 1.021, 持续时间: 1000 })
            ' 怎么办手续呢，'
            ' 我看看……'
            $执行.设置背景({ 资源路径: '/ImageAsset/bg000b.webp', 缩放: 1.021, 持续时间: 1000 })
            ' 就这样，我踏出了此次旅程的第一步。'
            $执行.设置背景({ 资源路径: '/ImageAsset/bg000d.webp', 缩放: 1.021, 持续时间: 1000 })
            ' 这是个平平无奇的起点。\n 我不过是在网上偶然找了这家旅行社。'
            ' 随后……'
            ' 一场特殊的旅行开始了。'
            $执行.解锁成就(0)
            $执行.关闭音频({ 作用目标: 'bgm', 持续时间: 2000 })
            // ----
            $执行.解锁鉴赏('music1')
            $等待.播放视频({ 资源路径: '/OP.mp4' })
    }
}
